import { Injectable } from '@angular/core';
import { News } from '../model/news.model';

@Injectable({
  providedIn: 'root'
})
export class NewsService {
  private mockNews: News[] = [
    {
      id: 1,
      title: 'جامعة الأقصر تشارك في مارثون عالمي للتوعية ضد شلل الأطفال',
      description:
        'برعاية السيدة الدكتورة صبرين عبد الجليل، رئيس جامعة الأقصر، شاركت الجامعة صباح اليوم في مارثون "سباق من أجل القضاء على شلل الأطفال" تحت شعار "الرياضة في خدمة الإنسانية"، بهدف التوعية بأهمية التطعيم ضد شلل الأطفال. انضم إلى الفعالية مئات الطلاب وممثلي المجتمع المدني والسياح المقيمين.',
      imageUrl:
        './assets/new1.jpg',
      date: new Date('2025-10-12'),
      isFeatured: true
    },
    {
      id: 2,
      title: 'ندوة توعوية حول الويب المظلم والحياة الرقمية بكلية الفنون الجميلة',
      description:
        'برعاية السيدة الدكتورة صبرين عبد الجليل، رئيس جامعة الأقصر، نظم قطاع خدمة المجتمع وتنمية البيئة بالتعاون مع إدارة نظم المعلومات والتحول الرقمي، ندوة بعنوان "الويب المظلم والحياة الرقمية" بكلية الفنون الجميلة، وذلك تحت إشراف الدكتور أحمد محيي، عميد الكلية.',
      imageUrl:
        './assets/new2.jpg',
      date: new Date('2025-10-11'),
      isFeatured: false
    },
    {
      id: 3,
      title: 'جامعة الأقصر تدعم الطلاب المغتربين بمبادرة الدعم النفسي',
      description:
        'برعاية السيدة الدكتورة صبرين جابر عبد الجليل، رئيس جامعة الأقصر، أطلق قطاع خدمة المجتمع وتنمية البيئة أولى أنشطة مبادرة "الدعم النفسي للطلاب المغتربين" بنهجة توعوية بمهجع الطالبات بمدينة طيبة. قدم الندوة الأستاذ الدكتور هاني عبد الفتاح، مدير مكتب الدعم النفسي، والأستاذ الدكتور رضا عطا الله، منسق التواصل المجتمعي بالجامعة، بحضور الدكتور أحمد يوسف، مدير عام مهاجع الجامعة.',
      imageUrl:
        './assets/new3.jpg',
      date: new Date('2025-10-10'),
      isFeatured: false
    },
    {
      id: 4,
      title: 'جامعة الأقصر تنعى العالم الجليل الدكتور أحمد عمر هاشم',
      description:
        'تنعى جامعة الأقصر بأسى عميق وفاة العالم الجليل الدكتور أحمد عمر هاشم، الرئيس السابق لجامعة الأزهر وعضو هيئة كبار العلماء بمجمع الأزهر. وأعربت السيدة الدكتورة صبرين عبد الجليل، رئيس جامعة الأقصر، عن خالص تعازيها وحزنها الشديد لأسرته وطلابه ومحبيه، داعية الله أن يتغمد الفقيد بواسع رحمته وأن يسكنه فسيح جناته.',
      imageUrl:
        './assets/new4.jpg',
      date: new Date('2025-10-09'),
      isFeatured: false
    },
    {
      id: 5,
      title: 'رئيسة جامعة الأقصر تهنئ الدكتور خالد الإناني على فوزه بمنصب المدير العام لليونسكو',
      description:
        'أهنت السيدة الدكتورة صبرين عبد الجليل، رئيس جامعة الأقصر، الدكتور خالد الإناني على انتخابه مديرًا عامًا لليونسكو بـ55 صوتًا من أصل 57 صوتًا. وأكدت أن هذا الإنجاز التاريخي يُضاف إلى سجل مصر الدبلوماسي والثقافي، ويعكس المكانة الحضارية لمصر والثقة العالمية في التميز والقيادة المصرية.',
      imageUrl:
        './assets/new5.jpg',
      date: new Date('2025-10-08'),
      isFeatured: false
    }
  ];

  getLatestNews(): News[] {
    return this.mockNews;
  }

  getFeaturedNews(): News | undefined {
    return this.mockNews.find(news => news.isFeatured);
  }
}